In [38]:
import json
import pandas as pd
import numpy as np
from pandas.io.json import json_normalize

In [39]:
with open('modified_data.json') as f:
    data = json.loads(f.read())

rows = []

for university in data['University']:
    row = {}
    row['University name'] = university['name']
    row['Total students'] = university.get('Student and Staff', {}).get('Total students', 'N/A')
    row['International students'] = university.get('Student and Staff', {}).get('International students', 'N/A')
    row['Total faculty staff'] = university.get('Student and Staff', {}).get('Total faculty staff', 'N/A')

    for admission_type, admission in university['Admission'].items():
        if admission_type == 'General':
            row['GMAT'] = admission.get('GMAT', 'N/A')
            row['IELTS'] = admission.get('IELTS', 'N/A')
            row['TOEFL'] = admission.get('TOEFL', 'N/A')
        elif admission_type == 'Bachelor':
            row['SAT'] = admission.get('SAT', 'N/A')
            row['TOEFL'] = admission.get('TOEFL', 'N/A')
        elif admission_type == 'Master':
            # row['GMAT'] = admission.get('GMAT', 'N/A')
            row['GPA'] = admission.get('GPA', 'N/A')
            row['GRE'] = admission.get('GRE', 'N/A')
            row['SAT'] = admission.get('SAT', 'N/A')
            row['ATAR'] = admission.get('ATAR', 'N/A')
    rows.append(row)

In [40]:
df = pd.DataFrame(rows)
df

,University name,Total students,International students,Total faculty staff,GMAT,IELTS,TOEFL,SAT,GPA,GRE,ATAR
0,Massachusetts Institute of Technology (MIT),"11,035","3,627","2,919",728+,7+,100+,1520+,NaN,NaN,NaN
1,Harvard University,"21,877","5,379","4,480",610+,N/A,80+,1470+,NaN,NaN,NaN
2,University of Cambridge,"20,871","7,865","5,735",N/A,7+,100+,1460+,NaN,NaN,NaN
3,University of Oxford,"21,972","9,024","6,650",N/A,7+,100+,1470+,NaN,NaN,NaN
4,Stanford University,"14,518","3,318","4,694",600+,N/A,101+,1420+,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
498,Universität Regensburg,"20,539","1,705","3,252",NaN,NaN,NaN,NaN,NaN,NaN,NaN
499,"Université de Savoie, Chambery, Annecy",N/A,N/A,N/A,NaN,NaN,NaN,NaN,NaN,NaN,NaN
500,Wayne State University,"21,139","1,058","2,530",530+,6+,79+,1060+,NaN,NaN,NaN
501,Wroclaw University of Science and Technology (...,"22,967","1,054","2,105",NaN,NaN,NaN,NaN,NaN,NaN,NaN
502,York University,"43,324","12,687","1,531",550+,7+,83+,1290+,2+,N/A,N/A

In [41]:
df.to_csv('university_info_data.csv')
df

,University name,Total students,International students,Total faculty staff,GMAT,IELTS,TOEFL,SAT,GPA,GRE,ATAR
0,Massachusetts Institute of Technology (MIT),"11,035","3,627","2,919",728+,7+,100+,1520+,NaN,NaN,NaN
1,Harvard University,"21,877","5,379","4,480",610+,N/A,80+,1470+,NaN,NaN,NaN
2,University of Cambridge,"20,871","7,865","5,735",N/A,7+,100+,1460+,NaN,NaN,NaN
3,University of Oxford,"21,972","9,024","6,650",N/A,7+,100+,1470+,NaN,NaN,NaN
4,Stanford University,"14,518","3,318","4,694",600+,N/A,101+,1420+,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
498,Universität Regensburg,"20,539","1,705","3,252",NaN,NaN,NaN,NaN,NaN,NaN,NaN
499,"Université de Savoie, Chambery, Annecy",N/A,N/A,N/A,NaN,NaN,NaN,NaN,NaN,NaN,NaN
500,Wayne State University,"21,139","1,058","2,530",530+,6+,79+,1060+,NaN,NaN,NaN
501,Wroclaw University of Science and Technology (...,"22,967","1,054","2,105",NaN,NaN,NaN,NaN,NaN,NaN,NaN
502,York University,"43,324","12,687","1,531",550+,7+,83+,1290+,2+,N/A,N/A

In [42]:
df1 = pd.read_csv('QS_World_University_Rankings_by_Subject_2022_Natural_Sciences.csv')

# Select the desired columns from the first CSV file
columns_to_copy = df1[['World Rank', 'City', 'Country']]

# Read in the second CSV file
df2 = pd.read_csv('university_info_data.csv')

# Concatenate the columns from the first CSV file with the second CSV file
result = pd.concat([df2, columns_to_copy], axis=1)

In [43]:
result

,Unnamed: 0,University name,Total students,International students,Total faculty staff,GMAT,IELTS,TOEFL,SAT,GPA,GRE,ATAR,World Rank,City,Country
0,0,Massachusetts Institute of Technology (MIT),"11,035","3,627","2,919",728+,7+,100+,1520+,NaN,NaN,NaN,1,Cambridge,United States
1,1,Harvard University,"21,877","5,379","4,480",610+,NaN,80+,1470+,NaN,NaN,NaN,2,Cambridge,United States
2,2,University of Cambridge,"20,871","7,865","5,735",NaN,7+,100+,1460+,NaN,NaN,NaN,3,Cambridge,United Kingdom
3,3,University of Oxford,"21,972","9,024","6,650",NaN,7+,100+,1470+,NaN,NaN,NaN,4,Oxford,United Kingdom
4,4,Stanford University,"14,518","3,318","4,694",600+,NaN,101+,1420+,NaN,NaN,NaN,5,Stanford,United States
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,498,Universität Regensburg,"20,539","1,705","3,252",NaN,NaN,NaN,NaN,NaN,NaN,NaN,451-500,Regensburg,Germany
499,499,"Université de Savoie, Chambery, Annecy",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,451-500,Annecy,France
500,500,Wayne State University,"21,139","1,058","2,530",530+,6+,79+,1060+,NaN,NaN,NaN,451-500,Detroit,United States
501,501,Wroclaw University of Science and Technology (...,"22,967","1,054","2,105",NaN,NaN,NaN,NaN,NaN,NaN,NaN,451-500,Wroclaw,Poland
502,502,York University,"43,324","12,687","1,531",550+,7+,83+,1290+,2+,NaN,NaN,451-500,Toronto,Canada

In [65]:

result = result.reindex(columns=['World Rank', 'University name','City', 'Country', 'GMAT', 'IELTS', 'TOEFL', 'SAT', 'GRE', 'GPA', 'Total faculty staff', 'International students','Total students'])

In [66]:
result

,World Rank,University name,City,Country,GMAT,IELTS,TOEFL,SAT,GRE,GPA,Total faculty staff,International students,Total students
0,1,Massachusetts Institute of Technology (MIT),Cambridge,United States,728+,7+,100+,1520+,NaN,NaN,"2,919","3,627","11,035"
1,2,Harvard University,Cambridge,United States,610+,NaN,80+,1470+,NaN,NaN,"4,480","5,379","21,877"
2,3,University of Cambridge,Cambridge,United Kingdom,NaN,7+,100+,1460+,NaN,NaN,"5,735","7,865","20,871"
3,4,University of Oxford,Oxford,United Kingdom,NaN,7+,100+,1470+,NaN,NaN,"6,650","9,024","21,972"
4,5,Stanford University,Stanford,United States,600+,NaN,101+,1420+,NaN,NaN,"4,694","3,318","14,518"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,451-500,Universität Regensburg,Regensburg,Germany,NaN,NaN,NaN,NaN,NaN,NaN,"3,252","1,705","20,539"
499,451-500,"Université de Savoie, Chambery, Annecy",Annecy,France,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
500,451-500,Wayne State University,Detroit,United States,530+,6+,79+,1060+,NaN,NaN,"2,530","1,058","21,139"
501,451-500,Wroclaw University of Science and Technology (...,Wroclaw,Poland,NaN,NaN,NaN,NaN,NaN,NaN,"2,105","1,054","22,967"
502,451-500,York University,Toronto,Canada,550+,7+,83+,1290+,NaN,2+,"1,531","12,687","43,324"

In [67]:
result.to_csv('university_info_data.csv')

## Data preprocessing

In [68]:
df = pd.read_csv('university_info_data.csv')

In [69]:
df

,Unnamed: 0,World Rank,University name,City,Country,GMAT,IELTS,TOEFL,SAT,GRE,GPA,Total faculty staff,International students,Total students
0,0,1,Massachusetts Institute of Technology (MIT),Cambridge,United States,728+,7+,100+,1520+,NaN,NaN,"2,919","3,627","11,035"
1,1,2,Harvard University,Cambridge,United States,610+,NaN,80+,1470+,NaN,NaN,"4,480","5,379","21,877"
2,2,3,University of Cambridge,Cambridge,United Kingdom,NaN,7+,100+,1460+,NaN,NaN,"5,735","7,865","20,871"
3,3,4,University of Oxford,Oxford,United Kingdom,NaN,7+,100+,1470+,NaN,NaN,"6,650","9,024","21,972"
4,4,5,Stanford University,Stanford,United States,600+,NaN,101+,1420+,NaN,NaN,"4,694","3,318","14,518"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,498,451-500,Universität Regensburg,Regensburg,Germany,NaN,NaN,NaN,NaN,NaN,NaN,"3,252","1,705","20,539"
499,499,451-500,"Université de Savoie, Chambery, Annecy",Annecy,France,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
500,500,451-500,Wayne State University,Detroit,United States,530+,6+,79+,1060+,NaN,NaN,"2,530","1,058","21,139"
501,501,451-500,Wroclaw University of Science and Technology (...,Wroclaw,Poland,NaN,NaN,NaN,NaN,NaN,NaN,"2,105","1,054","22,967"
502,502,451-500,York University,Toronto,Canada,550+,7+,83+,1290+,NaN,2+,"1,531","12,687","43,324"

In [71]:
df = df.drop('Unnamed: 0', axis=1)

In [72]:
df.to_csv('university_info_data.csv')

In [27]:
df.count

<bound method DataFrame.count of      Unnamed: 0 World Rank                                    University name  \
0             0          1        Massachusetts Institute of Technology (MIT)
1             1          2                                 Harvard University
2             2          3                            University of Cambridge
3             3          4                               University of Oxford
4             4          5                                Stanford University
..          ...        ...                                                ...
498         498    451-500                             Universität Regensburg
499         499    451-500             Université de Savoie, Chambery, Annecy
500         500    451-500                             Wayne State University
501         501    451-500  Wroclaw University of Science and Technology (...
502         502    451-500                                    York University

           City         Country  GMAT IELTS TOEFL    SAT  GRE  GPA  \
0     Cambridge   United States  728+    7+  100+  1520+  NaN  NaN
1     Cambridge   United States  610+   NaN   80+  1470+  NaN  NaN
2     Cambridge  United Kingdom   NaN    7+  100+  1460+  NaN  NaN
3        Oxford  United Kingdom   NaN    7+  100+  1470+  NaN  NaN
4      Stanford   United States  600+   NaN  101+  1420+  NaN  NaN
..          ...             ...   ...   ...   ...    ...  ...  ...
498  Regensburg         Germany   NaN   NaN   NaN    NaN  NaN  NaN
499      Annecy          France   NaN   NaN   NaN    NaN  NaN  NaN
500     Detroit   United States  530+    6+   79+  1060+  NaN  NaN
501    Wroclaw           Poland   NaN   NaN   NaN    NaN  NaN  NaN
502     Toronto          Canada  550+    7+   83+  1290+  NaN   2+

    Total faculty staff International students Total students
0                 2,919                  3,627         11,035
1                 4,480                  5,379         21,877
2                 5,735                  7,865         20,871
3                 6,650                  9,024         21,972
4                 4,694                  3,318         14,518
..                  ...                    ...            ...
498               3,252                  1,705         20,539
499                 NaN                    NaN            NaN
500               2,530                  1,058         21,139
501               2,105                  1,054         22,967
502               1,531                 12,687         43,324

[503 rows x 14 columns]>

In [73]:
df.dtypes

World Rank                object
University name           object
City                      object
Country                   object
GMAT                      object
IELTS                     object
TOEFL                     object
SAT                       object
GRE                       object
GPA                       object
Total faculty staff       object
International students    object
Total students            object
dtype: object

In [75]:
df['Total faculty staff'] = df['Total faculty staff'].str.replace(',','').astype(float)
df['International students'] = df['International students'].str.replace(',','').astype(float)
df['Total students'] = df['Total students'].str.replace(',','').astype(float)

In [76]:
df.dtypes

World Rank                 object
University name            object
City                       object
Country                    object
GMAT                       object
IELTS                      object
TOEFL                      object
SAT                        object
GRE                        object
GPA                        object
Total faculty staff       float64
International students    float64
Total students            float64
dtype: object

In [77]:
df

,World Rank,University name,City,Country,GMAT,IELTS,TOEFL,SAT,GRE,GPA,Total faculty staff,International students,Total students
0,1,Massachusetts Institute of Technology (MIT),Cambridge,United States,728+,7+,100+,1520+,NaN,NaN,2919.0,3627.0,11035.0
1,2,Harvard University,Cambridge,United States,610+,NaN,80+,1470+,NaN,NaN,4480.0,5379.0,21877.0
2,3,University of Cambridge,Cambridge,United Kingdom,NaN,7+,100+,1460+,NaN,NaN,5735.0,7865.0,20871.0
3,4,University of Oxford,Oxford,United Kingdom,NaN,7+,100+,1470+,NaN,NaN,6650.0,9024.0,21972.0
4,5,Stanford University,Stanford,United States,600+,NaN,101+,1420+,NaN,NaN,4694.0,3318.0,14518.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,451-500,Universität Regensburg,Regensburg,Germany,NaN,NaN,NaN,NaN,NaN,NaN,3252.0,1705.0,20539.0
499,451-500,"Université de Savoie, Chambery, Annecy",Annecy,France,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
500,451-500,Wayne State University,Detroit,United States,530+,6+,79+,1060+,NaN,NaN,2530.0,1058.0,21139.0
501,451-500,Wroclaw University of Science and Technology (...,Wroclaw,Poland,NaN,NaN,NaN,NaN,NaN,NaN,2105.0,1054.0,22967.0
502,451-500,York University,Toronto,Canada,550+,7+,83+,1290+,NaN,2+,1531.0,12687.0,43324.0

In [81]:
df['GMAT'] = pd.to_numeric(df['GMAT'].str.replace('+',''), errors='coerce')
df['IELTS'] = pd.to_numeric(df['IELTS'].str.replace('+',''), errors='coerce')
df['TOEFL'] = pd.to_numeric(df['TOEFL'].str.replace('+',''), errors='coerce')
df['SAT'] = pd.to_numeric(df['SAT'].str.replace('+',''), errors='coerce')
df['GRE'] = pd.to_numeric(df['GRE'].str.replace('+',''), errors='coerce')
df['GPA'] = pd.to_numeric(df['GPA'].str.replace('+',''), errors='coerce')

C:\Users\akibi\AppData\Local\Temp\ipykernel_4040\2282186042.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['GMAT'] = pd.to_numeric(df['GMAT'].str.replace('+',''), errors='coerce')
C:\Users\akibi\AppData\Local\Temp\ipykernel_4040\2282186042.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['IELTS'] = pd.to_numeric(df['IELTS'].str.replace('+',''), errors='coerce')
C:\Users\akibi\AppData\Local\Temp\ipykernel_4040\2282186042.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['TOEFL'] = pd.to_numeric(df['TOEFL'].str.replace('+',''), errors='coerce')
C:\Users\akibi\AppData\Local\Temp\ipykernel_4040\2282186042.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['SAT'] = pd.to_numeric(df['SAT'].str.replace('+',''), errors='coerce')
C:\Users\akibi\AppData\Local\Temp\ipykernel_4040\2282186042.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['GRE'] = pd.to_numeric(df['GRE'].str.replace('+',''), errors='coerce')
C:\Users\akibi\AppData\Local\Temp\ipykernel_4040\2282186042.py:6: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['GPA'] = pd.to_numeric(df['GPA'].str.replace('+',''), errors='coerce')

In [82]:
df

,World Rank,University name,City,Country,GMAT,IELTS,TOEFL,SAT,GRE,GPA,Total faculty staff,International students,Total students
0,1,Massachusetts Institute of Technology (MIT),Cambridge,United States,728.0,7.0,100.0,1520.0,NaN,NaN,2919.0,3627.0,11035.0
1,2,Harvard University,Cambridge,United States,610.0,NaN,80.0,1470.0,NaN,NaN,4480.0,5379.0,21877.0
2,3,University of Cambridge,Cambridge,United Kingdom,NaN,7.0,100.0,1460.0,NaN,NaN,5735.0,7865.0,20871.0
3,4,University of Oxford,Oxford,United Kingdom,NaN,7.0,100.0,1470.0,NaN,NaN,6650.0,9024.0,21972.0
4,5,Stanford University,Stanford,United States,600.0,NaN,101.0,1420.0,NaN,NaN,4694.0,3318.0,14518.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,451-500,Universität Regensburg,Regensburg,Germany,NaN,NaN,NaN,NaN,NaN,NaN,3252.0,1705.0,20539.0
499,451-500,"Université de Savoie, Chambery, Annecy",Annecy,France,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
500,451-500,Wayne State University,Detroit,United States,530.0,6.0,79.0,1060.0,NaN,NaN,2530.0,1058.0,21139.0
501,451-500,Wroclaw University of Science and Technology (...,Wroclaw,Poland,NaN,NaN,NaN,NaN,NaN,NaN,2105.0,1054.0,22967.0
502,451-500,York University,Toronto,Canada,550.0,7.0,83.0,1290.0,NaN,2.0,1531.0,12687.0,43324.0

In [83]:
df.dtypes

World Rank                 object
University name            object
City                       object
Country                    object
GMAT                      float64
IELTS                     float64
TOEFL                     float64
SAT                       float64
GRE                       float64
GPA                       float64
Total faculty staff       float64
International students    float64
Total students            float64
dtype: object

In [84]:
df.isnull().sum()

World Rank                  0
University name             0
City                        6
Country                     0
GMAT                      372
IELTS                     299
TOEFL                     297
SAT                       343
GRE                       487
GPA                       437
Total faculty staff         7
International students      7
Total students              7
dtype: int64